------------------------------------------------------------------------------------------------------------------------------


--Удаление временных таблиц.
IF OBJECT_ID('tempdb..#HUSBAND_AND_WIFE') IS NOT NULL BEGIN DROP TABLE #HUSBAND_AND_WIFE END --Таблица мужей и жен.


------------------------------------------------------------------------------------------------------------------------------


--Создание временных таблиц.
CREATE TABLE #HUSBAND_AND_WIFE (
    FAMILY_ID   VARCHAR(36),    --Идентификатор семьи.
    HUSBAND     INT,            --Личное дело мужа.
    WIFE        INT,            --Личное дело жены.
)


------------------------------------------------------------------------------------------------------------------------------


--Выборка мужей и жен.
INSERT INTO #HUSBAND_AND_WIFE (FAMILY_ID, HUSBAND, WIFE)
SELECT 
    NEWID()         AS FAMILY_ID,
    husband.A_ID1   AS HUSBAND,
    wife.A_ID1      AS WIFE
FROM WM_RELATEDRELATIONSHIPS husband --Родственные связи.
----Родственная связь.
    INNER JOIN WM_RELATEDRELATIONSHIPS wife
        ON wife.A_ID1 = husband.A_ID2       --Жена у мужа есть в родственных связях.
            AND husband.A_ID1 = wife.A_ID2  --Муж у жены есть в родственных связях.
WHERE wife.A_STATUS = 10        --Статус в БД "Действует".
    AND husband.A_STATUS = 10   --Статус в БД "Действует".
    AND husband.A_RELATED_RELATIONSHIP = 8  --Является женой по отношению к мужчине.
    AND wife.A_RELATED_RELATIONSHIP = 9     --Является мужом по отношению к женщине.
    
    
------------------------------------------------------------------------------------------------------------------------------


--Проверка.
SELECT * FROM #HUSBAND_AND_WIFE
ORDER BY HUSBAND


------------------------------------------------------------------------------------------------------------------------------